wentbackward/esp32_do_it/sdkconfig.defaults.esp32s3_lgfx_7inch
# Board: ELECROW CrowPanel-ESP32 7" 800x480 + RGB Panel + I2C GT911
# SKU: DIS08070H, Board Version: V3.0
# Using LovyanGFX display driver
# To use: idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.esp32s3_lgfx_7inch" build

# Display driver selection - LovyanGFX
CONFIG_APP_DISPLAY_LGFX=y
CONFIG_APP_LGFX_PANEL_RGB=y
CONFIG_IDF_TARGET="esp32s3"

# Display resolution
CONFIG_APP_LCD_HRES=800
CONFIG_APP_LCD_VRES=480

# Display common settings
CONFIG_APP_LCD_BGR=y
CONFIG_APP_LCD_INVERT_DEFAULT=n
CONFIG_APP_LCD_SWAP_BYTES=y

# Backlight (GPIO 2 with PWM control)
CONFIG_APP_LCD_PIN_BL=2
CONFIG_APP_LCD_BL_PWM_ENABLE=y
CONFIG_APP_LCD_BL_PWM_FREQ_HZ=5000
CONFIG_APP_LCD_BL_PWM_RESOLUTION=10
CONFIG_APP_LCD_BL_DEFAULT_DUTY=80

# RGB parallel display settings (used by lgfx_auto_config.hpp)
CONFIG_APP_LCD_RGB_PCLK_HZ=15000000
CONFIG_APP_LCD_RGB_PIN_PCLK=0
CONFIG_APP_LCD_RGB_PIN_HSYNC=39
CONFIG_APP_LCD_RGB_PIN_VSYNC=40
CONFIG_APP_LCD_RGB_PIN_DE=41

# RGB data pins (D0-D15)
CONFIG_APP_LCD_RGB_PIN_D0=15
CONFIG_APP_LCD_RGB_PIN_D1=7
CONFIG_APP_LCD_RGB_PIN_D2=6
CONFIG_APP_LCD_RGB_PIN_D3=5
CONFIG_APP_LCD_RGB_PIN_D4=4
CONFIG_APP_LCD_RGB_PIN_D5=9
CONFIG_APP_LCD_RGB_PIN_D6=46
CONFIG_APP_LCD_RGB_PIN_D7=3
CONFIG_APP_LCD_RGB_PIN_D8=8
CONFIG_APP_LCD_RGB_PIN_D9=16
CONFIG_APP_LCD_RGB_PIN_D10=1
CONFIG_APP_LCD_RGB_PIN_D11=14
CONFIG_APP_LCD_RGB_PIN_D12=21
CONFIG_APP_LCD_RGB_PIN_D13=47
CONFIG_APP_LCD_RGB_PIN_D14=48
CONFIG_APP_LCD_RGB_PIN_D15=45

# RGB timing settings
CONFIG_APP_LCD_RGB_HSYNC_POLARITY=0
CONFIG_APP_LCD_RGB_HSYNC_FRONT_PORCH=40
CONFIG_APP_LCD_RGB_HSYNC_PULSE_WIDTH=48
CONFIG_APP_LCD_RGB_HSYNC_BACK_PORCH=40
CONFIG_APP_LCD_RGB_VSYNC_POLARITY=0
CONFIG_APP_LCD_RGB_VSYNC_FRONT_PORCH=1
CONFIG_APP_LCD_RGB_VSYNC_PULSE_WIDTH=31
CONFIG_APP_LCD_RGB_VSYNC_BACK_PORCH=13
CONFIG_APP_LCD_RGB_PCLK_ACTIVE_NEG=1
CONFIG_APP_LCD_RGB_DE_IDLE_HIGH=0
CONFIG_APP_LCD_RGB_PCLK_IDLE_HIGH=0

# Touch driver selection
CONFIG_APP_TOUCH_GT911_I2C=y

# Touch I2C settings
CONFIG_APP_TOUCH_I2C_PORT=0
CONFIG_APP_TOUCH_PIN_SCL=20
CONFIG_APP_TOUCH_PIN_SDA=19
CONFIG_APP_TOUCH_I2C_CLOCK_HZ=400000
CONFIG_APP_TOUCH_I2C_ADDR=0x5D
CONFIG_APP_TOUCH_PIN_RST=-1
CONFIG_APP_TOUCH_MANUAL_RESET=n
CONFIG_APP_TOUCH_USE_INT_PIN=n

# Rotation
CONFIG_APP_ROT_SWAP_XY=0
CONFIG_APP_ROT_MIRROR_X=0
CONFIG_APP_ROT_MIRROR_Y=0

# ESP32-S3 CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ESP Tuning for performance
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_I2C_ISR_IRAM_SAFE=y
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_LEDC_CTRL_FUNC_IN_IRAM=y
CONFIG_MCPWM_ISR_HANDLER_IN_IRAM=y
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_SLAVE_IN_IRAM=y
CONFIG_TOUCH_CTRL_FUNC_IN_IRAM=y
CONFIG_TOUCH_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
# This makes it very unstable with LGFX, keep off:
CONFIG_LCD_RGB_RESTART_IN_VSYNC=n

# PSRAM configuration for RGB panel (requires large framebuffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n

# LVGL memory: use C library malloc for PSRAM boards
# LovyanGFX + LVGL benefits from dynamic PSRAM allocation
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_APP_LVGL_BUF_LINES=40
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=n
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=128
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=256
CONFIG_APP_LVGL_BUFF_DMA=y

# ESPTOOLPY settings
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
